doc/tiup/tidb.org
#+OPTIONS: \n:t
* OhMyTiup
  TiUP is one great deployment tool for TiDB. Once all the servers are available, it's very easy to deploy TiDB cluster with one config file. But how about installing the TiDB on the aws cloud.
  Before installing the TiDB on the aws, we need to prepare all the EC2 resource in advance. Please check the following resources to create.
  + VPC
  + subnets
  + route table
  + security group
  + Internet gateway
  + EC2 nodes
  It's really one boring process to prepare all the resouces. And after that, the config file has to been prepared with all the IPs. To reduce all these works. The OhMyTiIP is prepared to install TiDB on the AWS with one command.

* TiDB Creation
** Config file preparation
   Config the file according the requirement.
   #+BEGIN_SRC
$cp embed/examples/aws/aws-nodes-tidb.yaml /tmp/aws-nodes-tidb.yaml
$more /tmp/aws-nodes-tidb-.yaml
aws_topo_configs:
  general:
    # debian os
    imageid: ami-0ac97798ccf296e02
    region: ap-northeast-1
    name: tisamplenodes
    keyname: jay.pingcap
    keyfile: /home/tidb/.ssh/key-name.pem
    cidr: 172.83.0.0/16
    instance_type: m5.2xlarge
    tidb_version: v5.3.1
  pd:
    instance_type: m5.2xlarge
    count: 3
  tidb:
    instance_type: m5.2xlarge
    count: 2
  tikv:
    instance_type: m5.2xlarge
    count: 3
  dm:
    instance_type: m5.2xlarge
    count: 2
  ticdc:
    instance_type: t2.micro
    count: 1
   #+END_SRC

** Create the EC2 nodes and TiDB cluster
   #+BEGIN_SRC
$./bin/aws tidb2ms deploy demo-tidb /tmp/aws-nodes-tidb.yaml
./bin/aws tidb2ms deploy demo-tidb /tmp/aws-nodes-tidb.yaml
Please confirm your topology:                                                            
AWS Region:      Tokyo                                                                   
Cluster type:    tidb                                                                    
Cluster name:    demo-tidb        
Cluster version: v5.1.0            
User Name:       admin                                                                   
Key Name:        jay                                                                     
                                                                                         
Component    # of nodes  Instance Type  Image Name             CIDR           User
---------    ----------  -------------  ----------             ----           ----
Workstation  1           m5.2xlarge     ami-0ac97798ccf296e02  172.82.0.0/16  admin
TiDB         2           m5.2xlarge     ami-0ac97798ccf296e02  172.83.0.0/16  master
PD           3           m5.2xlarge     ami-0ac97798ccf296e02  172.83.0.0/16  master
TiKV         3           m5.2xlarge     ami-0ac97798ccf296e02  172.83.0.0/16  master
TiCDC        1           t2.micro       ami-0ac97798ccf296e02  172.83.0.0/16  master                                                                                              
DM           2           m5.2xlarge     ami-0ac97798ccf296e02  172.83.0.0/16  master
Attention:
    1. If the topology is not what you expected, check your yaml file.
    2. Please confirm there is no port/directory conflicts in same host.
Do you want to continue? [y/N]: (default=N) y
... ...
+ Deploying tidb2ms solution service ... ...
  - Prepare DMS servicer and additional network resources :22 ... Done

Verbose debug logs has been written to /home/pi/.tiup/logs/aws-nodes-debug-2022-04-20-15-11-12.log.
   #+END_SRC

