doc/tiup/tidb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-20 水 16:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8a382fb">1. OhMyTiup</a></li>
<li><a href="#orgc121512">2. TiDB Creation</a>
<ul>
<li><a href="#org3385143">2.1. Config file preparation</a></li>
<li><a href="#org49b1be4">2.2. Create the EC2 nodes and TiDB cluster</a></li>
<li><a href="#org448bb2c">2.3. List all the resources</a></li>
<li><a href="#orgf795bde">2.4. Login the workstation to check tidb cluster</a></li>
<li><a href="#orgdfe3cbf">2.5. Login the TiDB</a></li>
</ul>
</li>
<li><a href="#orgaaad967">3. TiDB Destroy</a></li>
<li><a href="#org4664b5e">4. Alternatives</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8a382fb" class="outline-2">
<h2 id="org8a382fb"><span class="section-number-2">1.</span> OhMyTiup</h2>
<div class="outline-text-2" id="text-1">
<p>
TiUP is one great deployment tool for TiDB. Once all the servers are available, it's very easy to deploy TiDB cluster with one config file. But how about installing the TiDB on the aws cloud.<br />
Before installing the TiDB on the aws, we need to prepare all the EC2 resource in advance. Please check the following resources to create.<br />
</p>
<ul class="org-ul">
<li>VPC<br /></li>
<li>subnets<br /></li>
<li>route table<br /></li>
<li>security group<br /></li>
<li>Internet gateway<br /></li>
<li>EC2 nodes<br /></li>
</ul>
<p>
It's really one boring process to prepare all the resouces. And after that, the config file has to been prepared with all the IPs. To reduce all these works. The OhMyTiIP is prepared to install TiDB on the AWS with one command.<br />
</p>
</div>
</div>

<div id="outline-container-orgc121512" class="outline-2">
<h2 id="orgc121512"><span class="section-number-2">2.</span> TiDB Creation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3385143" class="outline-3">
<h3 id="org3385143"><span class="section-number-3">2.1.</span> Config file preparation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Config the file according the requirement.<br />
</p>
<pre class="example">
$cp embed/examples/aws/aws-nodes-tidb.yaml /tmp/aws-nodes-tidb.yaml
$more /tmp/aws-nodes-tidb-.yaml
aws_topo_configs:
  general:
    # debian os
    imageid: ami-0ac97798ccf296e02
    region: ap-northeast-1
    name: tisamplenodes
    keyname: jay.pingcap
    keyfile: /home/tidb/.ssh/key-name.pem
    cidr: 172.83.0.0/16
    instance_type: m5.2xlarge
    tidb_version: v5.3.1
  pd:
    instance_type: m5.2xlarge
    count: 3
  tidb:
    instance_type: m5.2xlarge
    count: 2
  tikv:
    instance_type: m5.2xlarge
    count: 3
  dm:
    instance_type: m5.2xlarge
    count: 2
  ticdc:
    instance_type: t2.micro
    count: 1
</pre>
</div>
</div>

<div id="outline-container-org49b1be4" class="outline-3">
<h3 id="org49b1be4"><span class="section-number-3">2.2.</span> Create the EC2 nodes and TiDB cluster</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
$./bin/aws tidb2ms deploy demo-tidb /tmp/aws-nodes-tidb.yaml
./bin/aws tidb2ms deploy demo-tidb /tmp/aws-nodes-tidb.yaml
Please confirm your topology:                                                            
AWS Region:      Tokyo                                                                   
Cluster type:    tidb                                                                    
Cluster name:    demo-tidb        
Cluster version: v5.1.0            
User Name:       admin                                                                   
Key Name:        jay                                                                     

Component    # of nodes  Instance Type  Image Name             CIDR           User
---------    ----------  -------------  ----------             ----           ----
Workstation  1           m5.2xlarge     ami-0ac97798ccf296e02  172.82.0.0/16  admin
TiDB         2           m5.2xlarge     ami-0ac97798ccf296e02  172.83.0.0/16  master
PD           3           m5.2xlarge     ami-0ac97798ccf296e02  172.83.0.0/16  master
TiKV         3           m5.2xlarge     ami-0ac97798ccf296e02  172.83.0.0/16  master
TiCDC        1           t2.micro       ami-0ac97798ccf296e02  172.83.0.0/16  master                                                                                              
DM           2           m5.2xlarge     ami-0ac97798ccf296e02  172.83.0.0/16  master
Attention:
    1. If the topology is not what you expected, check your yaml file.
    2. Please confirm there is no port/directory conflicts in same host.
Do you want to continue? [y/N]: (default=N) y
... ...
+ Deploying tidb2ms solution service ... ...
  - Prepare DMS servicer and additional network resources :22 ... Done

Verbose debug logs has been written to /home/pi/.tiup/logs/aws-nodes-debug-2022-04-20-15-11-12.log.
</pre>
</div>
</div>
