doc/tiup/tidb.html

<div id="outline-container-org448bb2c" class="outline-3">
<h3 id="org448bb2c"><span class="section-number-3">2.3.</span> List all the resources</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
./bin/aws tidb2ms list demo-tidb                                                                                                                [39/4554]
+ Listing aws resources                                                                  
  - Listing VPC ... Done                                                                 
  - Listing Subnets ... Done                                                             
  - Listing Route Tables ... Done                                                        
  - Listing Security Groups ... Done                                                     
  - Listing Transit gateway  ... Done                                                    
  - Listing Transit gateway vpc attachment ... Done           
  - Listing EC2 ... Done                                                                 
  - Listing Load Balancer  ... Done                                                      
Cluster  Type:      ohmytiup-tidb2ms                                                     
Cluster Name :      demo-tidb                                                            

Resource Type:      VPC                                                                  
Component Name  VPC ID                 CIDR           Status
--------------  ------                 ----           ------
tidb            vpc-03c9e8c8ebd6dc379  172.83.0.0/16  available
workstation     vpc-08b3f64b0e2da3ab5  172.82.0.0/16  available

Resource Type:      Subnet                                                               
Component Name  Zone             Subnet ID                 CIDR            State      VPC ID
--------------  ----             ---------                 ----            -----      ------
tidb            ap-northeast-1a  subnet-0925eb6bc96a0f078  172.83.1.0/24   available  vpc-03c9e8c8ebd6dc379
tidb            ap-northeast-1c  subnet-04276e4efe84f4013  172.83.2.0/24   available  vpc-03c9e8c8ebd6dc379
tidb            ap-northeast-1d  subnet-0f599a88fca8c9650  172.83.3.0/24   available  vpc-03c9e8c8ebd6dc379
workstation     ap-northeast-1a  subnet-04d8a1197b487e759  172.82.11.0/24  available  vpc-08b3f64b0e2da3ab5

Resource Type:      Route Table                                                                                                                                                   
Component Name  Route Table ID         DestinationCidrBlock  TransitGatewayId       GatewayId              State   Origin         
--------------  --------------         --------------------  ----------------       ---------              -----   ------         
tidb            rtb-0e0c8962f43524767  172.82.0.0/16         tgw-056ec95c3166c9f67                         active  CreateRoute    
tidb            rtb-0e0c8962f43524767  172.83.0.0/16                                local                  active  CreateRouteTable
workstation     rtb-0242b9748b3bea5af  172.82.0.0/16                                local                  active  CreateRouteTable
workstation     rtb-0242b9748b3bea5af  172.83.0.0/16         tgw-056ec95c3166c9f67                         active  CreateRoute    
workstation     rtb-0242b9748b3bea5af  0.0.0.0/0                                    igw-0074cec5f85d57962  active  CreateRoute    
Resource Type:      Security Group                                                                                                                                        [3/4554]
Component Name  Ip Protocol  Source Ip Range  From Port  To Port                                                                                                                  
--------------  -----------  ---------------  ---------  -------                                                                                                                  
tidb            tcp          0.0.0.0/0        8300       8300                                                                                                                     
tidb            tcp          0.0.0.0/0        1433       1433
tidb            tcp          172.83.0.0/16    0          65535
tidb            tcp          0.0.0.0/0        20180      20180
tidb            tcp          0.0.0.0/0        22         22
tidb            tcp          0.0.0.0/0        4000       4000
tidb            tcp          0.0.0.0/0        2379       2379
tidb            tcp          0.0.0.0/0        20160      20160
tidb            tcp          0.0.0.0/0        2380       2380
tidb            tcp          0.0.0.0/0        3306       3306
tidb            icmp         172.83.0.0/16    -1         -1
tidb            tcp          0.0.0.0/0        10080      10080
workstation     tcp          0.0.0.0/0        80         80
workstation     tcp          172.82.0.0/16    0          65535
workstation     tcp          0.0.0.0/0        22         22
workstation     icmp         172.82.0.0/16    -1         -1

Resource Type:      Transit Gateway
Resource ID  :      tgw-056ec95c3166c9f67    State: available 
Component Name  VPC ID                 State 
--------------  ------                 ----- 
tidb            vpc-03c9e8c8ebd6dc379  available
workstation     vpc-08b3f64b0e2da3ab5  available

Load Balancer:      demo-tidb-ae2c828cb0134970.elb.ap-northeast-1.amazonaws.com
Resource Type:      EC2
Component Name  Component Cluster  State    Instance ID          Instance Type  Preivate IP    Public IP     Image ID
--------------  -----------------  -----    -----------          -------------  -----------    ---------     --------
dm              tidb               running  i-01ef16b9ebe410043  m5.2xlarge     172.83.1.37                  ami-0ac97798ccf296e02
dm              tidb               running  i-0ced85fb0c06e60ec  m5.2xlarge     172.83.2.103                 ami-0ac97798ccf296e02
pd              tidb               running  i-0f5ee16db90cce04e  m5.2xlarge     172.83.2.172                 ami-0ac97798ccf296e02
pd              tidb               running  i-08e507cbb0fd85ebf  m5.2xlarge     172.83.1.157                 ami-0ac97798ccf296e02
pd              tidb               running  i-013225724b2655a10  m5.2xlarge     172.83.3.156                 ami-0ac97798ccf296e02
ticdc           tidb               running  i-0fb6bef838ca64432  t2.micro       172.83.1.35                  ami-0ac97798ccf296e02
tidb            tidb               running  i-0992197c8e9d669ef  m5.2xlarge     172.83.1.143                 ami-0ac97798ccf296e02
tidb            tidb               running  i-0c9cc763185e541be  m5.2xlarge     172.83.2.32                  ami-0ac97798ccf296e02
tikv            tidb               running  i-08af52d0661210d53  m5.2xlarge     172.83.2.73                  ami-0ac97798ccf296e02
tikv            tidb               running  i-0b44220adde5b57ef  m5.2xlarge     172.83.1.171                 ami-0ac97798ccf296e02
tikv            tidb               running  i-011d223f561f8aa99  m5.2xlarge     172.83.3.44                  ami-0ac97798ccf296e02
workstation     workstation        running  i-028ac3ecd2f25bd78  m5.2xlarge     172.82.11.207  54.250.52.93  ami-0ac97798ccf296e02

</pre>
</div>
</div>
