doc/tiup/tidb.html

<div id="outline-container-orgf795bde" class="outline-3">
<h3 id="orgf795bde"><span class="section-number-3">2.4.</span> Login the workstation to check tidb cluster</h3>
<div class="outline-text-3" id="text-2-4">
<pre class="example">
$ ssh -i '~/.ssh/jaypingcap.pem' admin@54.250.52.93
$ tiup cluster list 
tiup is checking updates for component cluster ...
Starting component `cluster`: /home/admin/.tiup/components/cluster/v1.9.4/tiup-cluster /home/admin/.tiup/components/cluster/v1.9.4/tiup-cluster list
Name       User   Version  Path                                                  PrivateKey
----       ----   -------  ----                                                  ----------
demo-tidb  admin  v5.3.1   /home/admin/.tiup/storage/cluster/clusters/demo-tidb  /home/admin/.tiup/storage/cluster/clusters/demo-tidb/ssh/id_rsa
$ tiup cluster display demo-tidb 
tiup is checking updates for component cluster ...
Starting component `cluster`: /home/admin/.tiup/components/cluster/v1.9.4/tiup-cluster /home/admin/.tiup/components/cluster/v1.9.4/tiup-cluster display demo-tidb
Cluster type:       tidb
Cluster name:       demo-tidb
Cluster version:    v5.3.1
Deploy user:        admin
SSH type:           builtin
Dashboard URL:      http://172.83.1.157:2379/dashboard
ID                  Role  Host          Ports        OS/Arch       Status  Data Dir                               Deploy Dir
--                  ----  ----          -----        -------       ------  --------                               ----------
172.83.1.157:2379   pd    172.83.1.157  2379/2380    linux/x86_64  Up|UI   /home/admin/tidb/tidb-data/pd-2379     /home/admin/tidb/tidb-deploy/pd-2379
172.83.2.172:2379   pd    172.83.2.172  2379/2380    linux/x86_64  Up      /home/admin/tidb/tidb-data/pd-2379     /home/admin/tidb/tidb-deploy/pd-2379
172.83.3.156:2379   pd    172.83.3.156  2379/2380    linux/x86_64  Up|L    /home/admin/tidb/tidb-data/pd-2379     /home/admin/tidb/tidb-deploy/pd-2379
172.83.1.143:4000   tidb  172.83.1.143  4000/10080   linux/x86_64  Up      -                                      /home/admin/tidb/tidb-deploy/tidb-4000
172.83.2.32:4000    tidb  172.83.2.32   4000/10080   linux/x86_64  Up      -                                      /home/admin/tidb/tidb-deploy/tidb-4000
172.83.1.171:20160  tikv  172.83.1.171  20160/20180  linux/x86_64  Up      /home/admin/tidb/tidb-data/tikv-20160  /home/admin/tidb/tidb-deploy/tikv-20160
172.83.2.73:20160   tikv  172.83.2.73   20160/20180  linux/x86_64  Up      /home/admin/tidb/tidb-data/tikv-20160  /home/admin/tidb/tidb-deploy/tikv-20160
172.83.3.44:20160   tikv  172.83.3.44   20160/20180  linux/x86_64  Up      /home/admin/tidb/tidb-data/tikv-20160  /home/admin/tidb/tidb-deploy/tikv-20160
Total nodes: 8

</pre>
</div>
</div>

<div id="outline-container-orgdfe3cbf" class="outline-3">
<h3 id="orgdfe3cbf"><span class="section-number-3">2.5.</span> Login the TiDB</h3>
<div class="outline-text-3" id="text-2-5">
<pre class="example">
$ $ mysql -h demo-tidb-ae2c828cb0134970.elb.ap-northeast-1.amazonaws.com -u root -P 4000   
Welcome to the MariaDB monitor.  Commands end with ; or \g.
Your MySQL connection id is 801
Server version: 5.7.25-TiDB-v5.3.1 TiDB Server (Apache License 2.0) Community Edition, MySQL 5.7 compatible

Copyright (c) 2000, 2018, Oracle, MariaDB Corporation Ab and others.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

MySQL [(none)]&gt; show databases;
+--------------------+
| Database           |
+--------------------+
| INFORMATION_SCHEMA |
| METRICS_SCHEMA     |
| PERFORMANCE_SCHEMA |
| mysql              |
| test               |
+--------------------+
5 rows in set (0.003 sec)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaaad967" class="outline-2">
<h2 id="orgaaad967"><span class="section-number-2">3.</span> TiDB Destroy</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
$./bin/aws tidb2ms destroy demo-tidb
... ...
+ Destroying all the componets
  - Destroying EC2 nodes cluster demo-tidb  ... Done
  - Destroying aurora db cluster demo-tidb  ... Done
  - Destroying sqlserver cluster demo-tidb  ... Done
  - Destroying workstation cluster demo-tidb  ... Done
  - Destroying cloudformation demo-tidb  ... Done

</pre>
</div>
</div>


<div id="outline-container-org4664b5e" class="outline-2">
<h2 id="org4664b5e"><span class="section-number-2">4.</span> Alternatives</h2>
<div class="outline-text-2" id="text-4">
<p>
There are alternatives to achive the similar objectives.<br />
</p>
<ul class="org-ul">
<li>cloudform<br /></li>
<li>EKS<br /></li>
<li>ansible(etc)<br /></li>
</ul>
<p>
All these other tools help to achieve similar objectives. Will show the cloudform and EKS demo in the future. As for the ansible, I do not like it very well. One command is really good idea.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-04-20 水 16:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
